agency-services-transunion/lib/examples/xml/Fulfill - Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:Fulfill>
      <con:request>
        <data:AccountCode>?</data:AccountCode>
        <data:AccountName>?</data:AccountName>
        <data:RequestKey>?</data:RequestKey>
        <data:ClientKey>?</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>?</data:AddressLine1>
            <data:AddressLine2>?</data:AddressLine2>
            <data:City>?</data:City>
            <data:State>?</data:State>
            <data:Zipcode>?</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>?</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>?</data:FirstName>
            <data:LastName>?</data:LastName>
            <data:MiddleName>?</data:MiddleName>
            <data:Prefix>?</data:Prefix>
            <data:Suffix>?</data:Suffix>
          </data:FullName>
          <data:PhoneNumber>?</data:PhoneNumber>
          <data:Ssn>?</data:Ssn>
        </data:Customer>
        <data:EnrollmentKey>?</data:EnrollmentKey>
        <data:Language>?</data:Language>
        <data:ServiceBundleCode>?</data:ServiceBundleCode>
      </con:request>
    </con:Fulfill>
  </soapenv:Body>
</soapenv:Envelope>